# Bash Script for Hide Phishing URL Created by KP

url_checker() {
    if [ ! "${1//:*}" = http ]; then
        if [ ! "${1//:*}" = https ]; then
            echo -e "\e[40;31;5;31m[!] 𝕌ℝ𝕃 𝕟𝕠𝕟 𝕧𝕒𝕝𝕚𝕕𝕠. 𝕊𝕚 𝕡𝕣𝕖𝕘𝕒 𝕕𝕚 𝕦𝕥𝕚𝕝𝕚𝕫𝕫𝕒𝕣𝕖 𝕙𝕥𝕥𝕡 𝕠 𝕙𝕥𝕥𝕡𝕤.\e[0m"
            exit 1
        fi
    fi
}

printf "\e[1;34m◇◆◇◆◇◆◇◆◇◆◇◇◆◇◆◇◆◇◆◇◆◇◇◆◇◆◇◆◇◆◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇   \e[0m\n" 
echo -e "\e[1;36m                                                               \e[0m"
echo -e "\e[1;36m   ▄▄▄▄▄▄ ▄ .▄▄▄▄ .    • ▌ ▄ ·.  ▄▄▄· .▄▄ · ▄ •▄               \e[0m"
echo -e "\e[1;34m    •██  ██▪▐█▀▄.▀·    ·██ ▐███▪▐█ ▀█ ▐█ ▀. █▌▄▌▪              \e[0m"
echo -e "\e[1;32m     ▐█.▪██▀▐█▐▀▀▪▄    ▐█ ▌▐▌▐█·▄█▀▀█ ▄▀▀▀█▄▐▀▀▄·              \e[0m"
echo -e "\e[1;31m     ▐█▌·██▌▐▀▐█▄▄▌    ██ ██▌▐█▌▐█ ▪▐▌▐█▄▪▐█▐█.█▌              \e[0m"
echo -e "\e[1;35m     ▀▀▀ ▀▀▀ · ▀▀▀     ▀▀  █▪▀▀▀ ▀  ▀  ▀▀▀▀ ·▀  ▀              \e[0m"
echo -e "\e[1;32m⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⣀⣠⣤⣤⣤⣄⡀⠀⣾⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀   ⠀     \e[0m"        
echo -e "\e[1;32m⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣴⣿⣿⣿⣿⣿⣿⣿⣷⣀⣿⣠⣤⣄⣀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀       \e[0m"  
echo -e "\e[1;32m               ⢀⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠇                     \e[0m"              
echo -e "\e[1;32m⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\e[0m"        
echo -e "\e[1;32m⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⠀⠀⠀⠀⠀⠀⣹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\e[0m"        
echo -e "\e[1;32m⠀⠀⠀⠀⠀⣦⠀⠀⢠⡟⠀⠀⠀⣠⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\e[0m"        
echo -e "\e[1;32m⠀⠀⠀⠀⠀⠘⣧⡀⣿⢃⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\e[0m"        
echo -e "\e[1;32m⠀⠀⠀⠀⠀⠀⢹⣿⣷⣾⣿⣧⡟⠛⠛⠛⠛⠛⠉⠉⣿⣿⣉⠤⣚⣿⣿⣿⣿⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\e[0m"        
echo -e "\e[1;32m⠀⠀⠀⠀⠀⠀⢸⣟⡿⠿⣁⡿⠁⠀⠀⠀⠀⠀⠀⠀⠙⠿⢿⣿⣿⣿⣿⡿⠋⠘⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\e[0m"        
echo -e "\e[1;32m⠀⠀⠀⠀⠀⠀⡼⠋⠈⣤⡟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⡿⠋⠀⠀⣶⣿⣿⣷⣦⣄⣀⡀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\e[0m"        
echo -e "\e[1;32m⠀⠀⠀⠀⢀⢸⠈⠚⠛⠟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣴⡻⣽⠁⠀⠀⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣶⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\e[0m"        
echo -e "\e[1;32m⠀⠀⠀⢰⠃⠀⠀⢀⣶⡇⠀⠀⠀⠀⣠⣶⣶⣾⣿⣿⣿⣿⣿⢸⣯⡄⠀⢰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀\e[0m"        
echo -e "\e[1;32m⠀⠀⢀⣿⣶⣷⣿⣿⣿⠀⠀⢀⣴⣾⣿⣿⣿⣿⣿⣿⣿⣿⡟⣇⣽⡇  ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⣀⠀⠀⠀⠀⠀⠀\e[0m"        
echo -e "\e[1;32m⠀⠀⣼⣿⣿⣿⣿⣿⣏⣤⣶⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⢆⣤⠇⢰⣿⣿⣿⠿⢿⡿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⣄⠀⠀⠀\e[0m"        
echo -e "\e[1;32m⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣻⣿⡻⠀⣼⣿⣿⣿⠈⣙⣵⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣦⡀\e[0m"        
echo -e "\e[1;32m⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡻⣺⢿⡆⠀⣿⣿⣿⣿𝓫𝔂:𝕀R𝕐N𝔸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\e[0m"        
echo -e "\e[1;32m⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠥⠭⣼⡇⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿\e[0m" 
printf "\e[1;34m◇◆◇◆◇◆◇◆◇◆◇◇◆◇◆◇◆◇◆◇◆◇◇◆◇◆◇◆◇◆◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇   \e[0m\n" 
printf "\e[1;34m\e[0m\n"
echo -e "\e[40;38;5;82m〘𓄂𝓠𝓾𝓮𝓼𝓽𝓸 𝓼𝓽𝓻𝓾𝓶𝓮𝓷𝓽𝓸 𝓹𝓾ò 𝓷𝓪𝓼𝓬𝓸𝓷𝓭𝓮𝓻𝓮 𝓽𝓾𝓽𝓽𝓲 𝓲 𝓽𝓲𝓹𝓲 𝓭𝓲 𝓤𝓡𝓛 𝓬𝓸𝓶𝓮 𝓲 𝓬𝓸𝓵𝓵𝓮𝓰𝓪𝓶𝓮𝓷𝓽𝓲 𝓷𝓰𝓻𝓸𝓴𓆃〙\e[0m"
echo -e "\e[1;31m                   𓄂𝓛'𝓲𝓼𝓹𝓲𝓻𝓪𝔃𝓲𝓸𝓷𝓮  𝓮 𝓽𝓻𝓪𝓽𝓽𝓪 𝓭𝓪 𝓶𝓪𝓼𝓴𝓹𝓱𝓲𝓼𝓱𓆃 :::                  \e[0m\n"
printf "\e[1;34m◇◆◇◆◇◆◇◆◇◆◇◇◆◇◆◇◆◇◆◇◆◇◇◆◇◆◇◆◇◆◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇    \e[0m\n" 
echo -e "\e[40;35;5;35m ⦑ ℙ𝕙𝕚𝕤𝕙𝕚𝕟𝕘 𝕌ℝ𝕃 𝕓𝕪::: ElaNyx03 :::  ⦒\e[0m \n"

echo -n "ℙ𝕒𝕤𝕥𝕖 𝕡𝕙𝕚𝕤𝕙𝕚𝕟𝕘 𝕌ℝ𝕃 𝕙𝕖𝕣𝕖 (𝕨𝕚𝕥𝕙 𝕙𝕥𝕥𝕡 𝕠𝕣 𝕙𝕥𝕥𝕡𝕤)➢ "
read phish
printf "\e[1;34m◇◆◇◆◇◆◇◆◇◆◇◇◆◇◆◇◆◇◆◇◆◇◇◆◇◆◇◆◇◆◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇    \e[0m\n" 
url_checker $phish
short=$(curl -s https://da.gd/s/?url=${phish})
shorter=${short#https://}
echo -e "\e[31;5;31m ༻𝕄𝕒𝕤𝕔𝕙𝕖𝕣𝕒 𝔻𝕠𝕞𝕚𝕟𝕚𝕠༺\e[0m"
echo '𝔻𝕠𝕞𝕚𝕟𝕚𝕠 𝕡𝕖𝕣 𝕞𝕒𝕤𝕔𝕙𝕖𝕣𝕒𝕣𝕖 𝕝 𝕌ℝ𝕃 𝕕𝕚 𝕡𝕙𝕚𝕤𝕙𝕚𝕟𝕘 (𝕔𝕠𝕟 𝕙𝕥𝕥𝕡 𝕠 𝕙𝕥𝕥𝕡𝕤), 𝕖𝕩 𝕙𝕥𝕥𝕡𝕤://𝕘𝕠𝕠𝕘𝕝𝕖.𝕔𝕠𝕞, 𝕙𝕥𝕥𝕡://𝕒𝕟𝕪𝕥𝕙𝕚𝕟𝕘.𝕠𝕣𝕘) :'
echo -en "\e[32m=>\e[0m "
read mask
url_checker $mask
echo -e '\nℙ𝕒𝕣𝕠𝕝𝕖 𝕕𝕚 𝕥𝕚𝕡𝕠 𝕚𝕟𝕘𝕖𝕘𝕟𝕖𝕣𝕚𝕒 𝕤𝕠𝕔𝕚𝕒𝕝𝕖: (𝕔𝕠𝕞𝕖 𝕧𝕚𝕟𝕔𝕚 𝕗𝕒𝕔𝕚𝕝𝕖, 𝕥𝕣𝕦𝕔𝕔𝕙𝕚 𝔾𝕋𝔸)".'
echo -e "\e[31mℕ𝕠𝕟 𝕦𝕤𝕒𝕣𝕖 𝕝𝕠 𝕤𝕡𝕒𝕫𝕚𝕠 𝕞𝕒 𝕤𝕠𝕝𝕠 𝕚𝕝 '-' 𝕥𝕣𝕒 𝕝𝕖 𝕡𝕒𝕣𝕠𝕝𝕖 𝕕𝕚 𝕚𝕟𝕘𝕖𝕘𝕟𝕖𝕣𝕚𝕒 𝕤𝕠𝕔𝕚𝕒𝕝𝕖.\e[0m"
echo -en "\e[32m=>\e[0m "
read words
echo -e "\e[40;38;5;82m\n𝔾𝕖𝕟𝕖𝕣𝕒𝕫𝕚𝕠𝕟𝕖 𝕕𝕖𝕝 𝕝𝕚𝕟𝕜 𝕋𝕙𝕖𝕄𝕒𝕤𝕜...\n"
final=$mask-$words@$shorter
echo -e "ℚ𝕦𝕖𝕤𝕥𝕠 è 𝕝'𝕌ℝ𝕃 𝕕𝕚 𝕋𝕙𝕖𝕄𝕒𝕤𝕜 𝕠𝕣𝕒 𝕡𝕦𝕠𝕚 𝕚𝕟𝕧𝕚𝕒𝕣𝕝𝕠 𝕒𝕝𝕝𝕒 𝕧𝕚𝕥𝕥𝕚𝕞𝕒:➢ \e[32m ${final} \e[0m\n"
